# ============================================
# Brewfile
# Cross-platform packages for macOS + Linux
# ============================================

# --------------------------------------------
# Core CLI tools
# --------------------------------------------
brew "neovim"
brew "tmux"
brew "zellij"
brew "ripgrep"
brew "fd"
brew "fzf"
brew "eza"
brew "git"
brew "tree-sitter-cli"
brew "curl"

# Useful general terminal tools
brew "watch"
brew "htop"
brew "btop"
brew "nload"
brew "tree"

# --------------------------------------------
# Shell tools
# --------------------------------------------
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"

# --------------------------------------------
# Development helpers
# --------------------------------------------
brew "lazygit"
brew "lazydocker"
brew "k9s"

# Optional but useful for JSON/YAML work
brew "jq"
brew "yq"
